{
  "_id": {
    "$oid": "5fff0041bbd943a933c7ab33"
  },
  "name": "Language Search",
  "email": "Careers.NorthAmerica@sap.com",
  "mobile_number": null,
  "skills": [
    "Emea",
    "Analytical",
    "Lifecycle",
    "Engineering",
    "Plan",
    "Analytical skills",
    "Content",
    "Project management",
    "Computer science",
    "English",
    "Design",
    "Travel",
    "Erp",
    "Communication",
    "Customer requirements",
    "Technical",
    "Website",
    "Strategy",
    "Metrics",
    "Presentation",
    "Legal",
    "Recruiting",
    "Operations",
    "Retention",
    "Economics",
    "Agile",
    "Sap"
  ],
  "college_name": null,
  "degree": null,
  "designation": null,
  "experience": [],
  "company_names": null,
  "no_of_pages": 3,
  "total_experience": 0,
  "file_name": "jobs-sap-com-job-Bangalore-Development-Senior-Manager-SAP-Solutions-Manager-CIS-Focused-BuildInsights-Job-KA-601468001--.pdf",
  "all_text": "By continuing to use and navigate this website, you are agreeing to the use of cookies. \n\nAccept\n\n  Close\n\n \n View profile\n\nLanguage \n\nSearch by Keyword\nMore Options\nSearch by Location\n\nSearch Jobs\n\nSend me alerts every  7\n\n days  \u0000 Create Alert\n\nShare this Job\n\nDevelopment Senior Manager - SAP Solutions Manager CIS - Focused Build/Insights\nJob\n\nApply now \n\nDate: \nDate:  May 12, 2020\nCity:\nCity: Bangalore, KA, IN\nCompany: \nCompany:  SAP\nRequisition ID:252354\nWork Area: Software-Design and Development\nExpected Travel: 0 - 10%\nCareer Status: Executive\nEmployment Type: Regular Full Time\n \nCOMPANY DESCRIPTION\n \nSAP started in 1972 as a team of five colleagues with a desire to do something new. Together, they changed enterprise software and\nreinvented how business was done. Today, as a market leader in enterprise application software, we remain true to our roots. That’s why\nwe engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and\ncultures.\nSAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees. We know that a diverse\nand inclusive workforce keeps us competitive and provides opportunities for all. We believe that together we can transform industries,\ngrow economics, lift up societies and sustain our environment. Because it’s the best-run businesses that make the world run better and\nimprove people’s lives.\n \nPurpose and Objective of Job\n \nAs the market leader of ERP software, SAP Product Engineering Group provides a complete portfolio of maintenance offerings and a\ncomprehensive range of services that enable customers to continually improve core business processes while leveraging their existing\nsolutions. The SAP Solution Manager is a service platform, which is designed to assist customers to implementing and operating their IT\nsolutions efficiently to increase the reliability and lower the cost of ownership. This product provides the tools, the integrated content, and\nthe gateway to SAP that you need to implement, operate, and monitor your SAP centric solutions and hybrid solutions, thereby\naccelerating the transition phase to Intelligent Enterprise. Continuous Innovation Services team is responsible for the innovation and\n\n\fstabilization of SAP Solution Manager, which is the premier platform for the on-Premise customer installed base and partners, where we\nwill deliver continuous innovation until at least 2027 and beyond.\n \nFocused Build for SAP Solution Manager is a ready-to-run and integrated, tool-supported methodology to manage requirements and\nsoftware development in large, agile projects. It is based on pre-configured standard SAP Solution Manager features and processes, as\nwell as additional build functions.\n \nFocused Insights for SAP Solution Manager unifies, aggregates and correlates all SAP Solution Manager’s metrics in single\ncomprehensive views.\nIt offers standard dashboards supporting all SAP ALM scenarios for RunSAP and BuildSAP. By delivering the most relevant and valuable\ninformation to the right people in real time, Focused Insights helps SAP IT departments to build and distribute powerful dashboards\ntailored to all SAP IT users (operators, basis teams, application managers, CIO, …).\n \n \nExpectations and Tasks\n \nYou will be building up and managing a development team ranking from early talents to experienced experts with the goal of delivering\nworld class continuous innovation to our products and services. Your areas of responsibility will be our Focused Solutions (Focused Build\nand Focus Insights). This requires a deep understanding of customers challenges in the area of application lifecycle management and a\nprofound understanding of the processes from requirement to deploy.\nPreferred candidates will have a proven record of exceptional customer focus, being open-minded and flexible to manage a team in a\nhighly diverse organization.\nTherefore Honesty, Accountability, Integrity, Empathy, and Respectfulness should be part of your DNA.\n \nTasks include:\n \n\nSet direction by building your team’s strategy and business plan and contribute to the overall strategy of the unit in close collaboration\nwith your direct manager\nDrive time critical development projects delivering outstanding results\nWork collaboratively with other development teams and stakeholders to define priorities, plan projects and ensure milestones are met.\nDelivery in time with quality is key.\nBuild product expertise and technical understanding in the topics under your responsibility\nBuild bridges between customer requirements and technical feasibility\nSpread strong customer centricity across the team, being a role model and showing appreciation and recognition for exceptional\ncustomer focus and success\nSupport the growth of your people, keeping their skills up-to-date and motivating them by providing challenging opportunities and\nperspectives.\nManage Knowledge Retention in the team in a very competitive environment attracting the best talents\nManage and Avoid Customer Escalations in a diplomatic and patient way\n\n \nWork Experience\n \n-Work experience at least 10 years in development projects / teams\n-People management, project management, and/or technical leadership background is mandatory\n-Product and technical expertise in the topics under your responsibility is a plus\n- Having experience in application lifecycle management and SAP Solution Manager is a plus.\n \nEducation and Qualifications / Skills and Competencies\n \n-B.S or above in computer science or comparable education\n-Strong project management skills with the ability of multi-tasking as the standard mode of operation\n-Strong problem resolution skills with good leadership, diplomacy, decision making and analytical skills\n-Strong communication and presentation skills\n-High customer orientation\n-Ability to handle stressful situations\n-Be open minded, willing to challenge the status quo and seek for innovative ideas\n-Excellency in English, both verbal and written is a must\nWHAT YOU GET FROM US\nSuccess is what you make it. At SAP, we help you make it your own. A career at SAP can open many doors for you. If you’re searching for\n\n\fa company that’s dedicated to your ideas and individual growth, recognizes you for your unique contributions, fills you with a strong sense\nof purpose, and provides a fun, flexible and inclusive work environment – apply now.\nSAP'S DIVERSITY COMMITMENT \nTo harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and\nappreciate the unique competencies that each person brings to the company.\nSAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with\nphysical and/or mental disabilities. If you are in need of accommodation or special assistance to navigate our website or to complete your\napplication, please send an e-mail with your request to Recruiting Operations Team\n(Americas: Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com,\nEMEA: Careers@sap.com).\nSuccessful candidates might be required to undergo a background verification with an external vendor.\nAdditional Locations: \n\nJob Segment: \nJob Segment:  Developer, ERP, Engineer, SAP, Manager, Technology, Engineering, Management\n\nApply now \n\nFind similar jobs:\nSAP Jobs in India, Manager Jobs in Bangalore, Engineering Jobs in India, Computer Science Jobs in Bangalore, Asia-\nPacific Development & Technology\n\n    \n\nTop Jobs\n\nView All Jobs\n\nAbout SAP\nAbout SAP\nSAP.com\nCareers\n\nWorldwide Directory\n\nEvents\n\nNews and Press\n\nSite Information\nSite Information\n\nPrivacy\n\nTerms of Use\nLegal Disclosure\n\nCopyright\nTrademark\n\nContact\nContact\nContact Us\n\n\f",
  "session_id": "5f64313a-c720-43de-9b4b-84a46ab16e95"
}